Revit 2024 API
DuctSizes.Contains Method
 Checks whether a duct size with the nominal diameter exists.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool Contains(
	double nominalDiameter
)
Visual Basic
Public Function Contains ( _
	nominalDiameter As Double _
) As Boolean
Visual C++
public:
bool Contains(
	double nominalDiameter
)
Parameters
nominalDiameter
Type: System.Double
 Nominal diameter.
Return Value
 True if a duct size with the nominal diameter exists.
See Also
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace